// export const initState = {
//     id:'001',
//     department:[
//         {   
//             id:1001,
//             name:'总经办',
//             child:[{nick:'小年糕',mid:'2346457864'},{nick:'小板凳',mid:'2543784567'},{nick:'小豆包',mid:'2673789045'}]
//         },
//         {
//             id:1002,
//             name:'财务部',
//             child:[{nick:'小年糕',mid:'1245367846'},{nick:'小板凳',mid:'1362563456'},{nick:'小豆包',mid:'1243563567'}]
//         },
//         {
//             id:1003,
//             name:'工程部',
//             child:[{nick:'小年糕',mid:'3564251345'},{nick:'小板凳',mid:'3562712356'},{nick:'小豆包',mid:'3562458964'}]
//         },
        
//     ],
//     product:[
//         {
//             id:2001,
//             name:'开发一组',
//             child:[{nick:'白帆1',mid:'2346457864'},{nick:'小板凳',mid:'2346457864'},{nick:'小豆包',mid:'2346457864'}]
//         },
//         {
//             id:2002,
//             name:'开发二组',
//             child:[{nick:'白饭',mid:'1245367846'},{nick:'小板凳',mid:'1362563456'},{nick:'小豆包',mid:'1243563567'}]
//         },
//         { 
//             id:2003,
//             name:'测试组',
//             child:[{nick:'白白',mid:'1245367846'},{nick:'小板凳',mid:'1362563456'},{nick:'小豆包',mid:'1243563567'}]
//         }
//     ]
// }









export const initState = {
   1:{id: 1,name: '所有部门',child:[2] },
   2:{id:2,name:'爱奇迪集团',child:[3]},
   3:{id:3,name:'广州分公司',child:[4,5,6,7]},
   4:{id:4,name:'总经办', members:[{nick:'小年糕',mid:'2346457864'},{nick:'小板凳',mid:'2346457864'},{nick:'小豆包',mid:'2346457864'}]
},
   5:{id:5,name:'财务部', members:[{nick:'小年糕',mid:'1245367846'},{nick:'小板凳',mid:'1362563456'},{nick:'小豆包',mid:'1243563567'}]
},
   6:{id:6,name:'工程部', members:[{nick:'小年糕',mid:'1245367846'},{nick:'小板凳',mid:'1362563456'},{nick:'小豆包',mid:'1243563567'}]
},
   7:{id:7,name:'产品研发部',child:[8,9,10]},
   8:{id:8,name:'开发一组', members:[{nick:'白帆1',mid:'2346457864'},{nick:'小板凳',mid:'2346457864'},{nick:'小豆包',mid:'2346457864'}]
},
   9:{id:9,name:'开发二组', members:[{nick:'白饭',mid:'1245367846'},{nick:'小板凳',mid:'1362563456'},{nick:'小豆包',mid:'1243563567'}]
},
   10:{id:10,name:'测试组', members:[{nick:'白白',mid:'1245367846'},{nick:'小板凳',mid:'1362563456'},{nick:'小豆包',mid:'1243563567'}]
},
}





















// export const initState = {
//     data:{
//         all:{
//             id:1001,
//             name:'所有部门',
//             firstbranch:{
//                 id:2001,
//                 name:'爱奇迪集团',
//                 secondbranch:{
//                     id:3001,
//                     name:'广州分公司',
//                     thirdbranch:{
//                         id:4001,
//                         department:[
//                             {   
//                                 id:1001,
//                                 name:'总经办',
//                                 child:[{nick:'小年糕',mid:'2346457864'},{nick:'小板凳',mid:'2346457864'},{nick:'小豆包',mid:'2346457864'}]
//                             },
//                             {
//                                 id:1002,
//                                 name:'财务部',
//                                 child:[{nick:'小年糕',mid:'1245367846'},{nick:'小板凳',mid:'1362563456'},{nick:'小豆包',mid:'1243563567'}]
//                             },
//                             {
//                                 id:1003,
//                                 name:'工程部',
//                                 child:[{nick:'小年糕',mid:'1245367846'},{nick:'小板凳',mid:'1362563456'},{nick:'小豆包',mid:'1243563567'}]
//                             },
//                             {
//                                 id:1004,
//                                 name:'产品研发部',
//                                 productbranch:[
//                                     {
//                                         id:2001,
//                                         name:'开发一组',
//                                         child:[{nick:'白帆1',mid:'2346457864'},{nick:'小板凳',mid:'2346457864'},{nick:'小豆包',mid:'2346457864'}]
//                                     },
//                                     {
//                                         id:2002,
//                                         name:'开发二组',
//                                         child:[{nick:'白饭',mid:'1245367846'},{nick:'小板凳',mid:'1362563456'},{nick:'小豆包',mid:'1243563567'}]
//                                     },
//                                     { 
//                                         id:2003,
//                                         name:'测试组',
//                                         child:[{nick:'白白',mid:'1245367846'},{nick:'小板凳',mid:'1362563456'},{nick:'小豆包',mid:'1243563567'}]
//                                     }
//                                 ]
//                             }
//                         ],
//                     }
//                 },
//             },
//         },
//     }
// }




